import csv
import pandas as pd


def csv_worker():
    """ Считывает финансовые операции из CSV """
    pass


def excel_worker():
    """ Считывает финансовые операции из Excel """
    pass


"""
Реализована функция для считывания финансовых операций из CSV.
Функция для считывания финансовых операций из CSV принимает путь к файлу CSV в качестве аргумента.
Функция для считывания финансовых операций из CSV выдает список словарей с транзакциями.

Реализована функция для считывания финансовых операций из Excel.
Функция для считывания финансовых операций из Excel принимает путь к файлу Excel в качестве аргумента.
Функция для считывания финансовых операций из Excel выдает список словарей с транзакциями.
"""